
# 练习 1: if 条件判断
# 题目: 判断闰年
# 规则: 能被4整除且不能被100整除，或能被400整除
# ---------------------------------------------------------
print("--- 练习 1: 判断闰年 ---")
year = 2024
if (year%4==0 and year%100!=0)or year%400==0:
   print(f'{year}是闰年')
else:
    print(f'{year}不是闰年')





# ---------------------------------------------------------
# 练习 2: for 循环
# 题目: 打印九九乘法表 (右上三角形)
# 预期输出:
# 1x1=1
# 1x2=2  2x2=4
# 1x3=3  2x3=6  3x3=9
# ...
# ---------------------------------------------------------
print("\n--- 练习 2: 九九乘法表 ---")
# 在这里写代码:
#for b in range(1,c+1):
       # print(f'{b}*{c}={c*b}',end='\t')






# 练习 3: while 循环
# 题目: 猜数字游戏
# 1. 生成1-100的随机数
# 2. 用户输入猜测 (用 input() 或直接给值测试)
# 3. 如果猜对，打印 "恭喜！" 并退出
# 4. 如果没猜对，提示"太大"或"太小"
import random
num1=random.randint(1,100)
num2=int(input('请输入猜测值'))
while num1!=num2:
    if num1<num2:
        print('太大') 
        num2=int(input('请输入猜测值'))
    elif num1>num2:
        print('太小')
        num2=int(input('请输入猜测值'))
    else:
        break
print('恭喜')
        







